/**
 * [JAVA독과 함께](https://www.notion.so/a5a0fafe306e4cb78ec4476a272d156d?v=e116f6cdc6e34075bf8e4c0e56429a26&p=f8e2a3458b72470a98e37826634e797b)
 */

// const 돌의내구도 = [1, 2, 1, 4];
const 돌의내구도 = [5, 3, 4, 1, 3, 8, 3]
const 독 = [{
    '이름': '루비독',
    '나이': '95년생',
    '점프력': '3',
    '몸무게': '4'
}, {
    '이름': '피치독',
    '나이': '95년생',
    '점프력': '3',
    '몸무게': '3'
}, {
    '이름': '씨-독',
    '나이': '72년생',
    '점프력': '2',
    '몸무게': '1'
}, {
    '이름': '코볼독',
    '나이': '59년생',
    '점프력': '1',
    '몸무게': '1'
}
];

// function 징검다리를건너라(내구도, 독) {
//     const answer = [];
//     for (let 개별독 of 독) {
//         let 독의위치 = 0;
//         let 실패 = false;
//         while (독의위치 < 내구도.length) {
//             독의위치 += Number(개별독['점프력']);
//             내구도[독의위치 - 1] -= Number(개별독['몸무게']);
//             if (내구도[독의위치 - 1] < 0) {
//                 독의위치 = 0;
//                 실패 = true;
//                 break;
//             }
//         }
//         if (!실패) {
//             answer.push(개별독['이름']);
//         }
//     }
//     return answer;
// }

function 징검다리를건너라(내구도, 개들) {
    return 개들.filter(개 => {
        let 독의위치 = 0;
        let 실패 = false;
        while (독의위치 < 내구도.length) {
            독의위치 += Number(개['점프력']);
            내구도[독의위치 - 1] -= Number(개['몸무게']);
            if (내구도[독의위치 - 1] < 0) {
                독의위치 = 0;
                실패 = true;
                break;
            }
        }
        return !실패;
    }).map(개 => 개['이름'])
}

console.log(징검다리를건너라(돌의내구도, 독));